Looking at the provider code I found the section in `waitForClusterV2State()` where we get the forbidden error when getting the V2 cluster ID: https://github.com/rancher/terraform-provider-rancher2/blob/6704c32e373dba57e30c1a4d6409d28ac23badb7/rancher2/resource_rancher2_cluster_v2.go#L216-L219

I performed a quick experiment locally, adding the `IsNotFound() || IsForbidden()` check after calling `getClusterV2ByID()`, arriving at the following implementation for `waitForClusterV2State()`:

```go
func waitForClusterV2State(c *Config, id, state string, interval time.Duration) (*ClusterV2, error) {
	if id == "" || state == "" {
		return nil, fmt.Errorf("Cluster V2 ID and/or condition is nil")
	}

	ctx, cancel := context.WithTimeout(context.Background(), interval)
	defer cancel()
	for {
		obj, err := getClusterV2ByID(c, id)
		if IsNotFound(err) || IsForbidden(err) {
			log.Printf("[INFO] Cluster ID %s not found.", id)
		} else if err != nil {
			return nil, fmt.Errorf("Getting cluster V2 ID (%s): %v", id, err)
		}
		if obj != nil {
			for i := range obj.Status.Conditions {
				if obj.Status.Conditions[i].Type == state {
					// Status of the condition, one of True, False, Unknown.
					if obj.Status.Conditions[i].Status == "Unknown" {
						break
					}
					if obj.Status.Conditions[i].Status == "True" {
						return obj, nil
					}
					// When cluster condition is false, retrying if it has been updated for last rancher2WaitFalseCond seconds
					lastUpdate, err := time.Parse(time.RFC3339, obj.Status.Conditions[i].LastUpdateTime)
					if err == nil && time.Since(lastUpdate) < rancher2WaitFalseCond*time.Second {
						break
					}
					return nil, fmt.Errorf("Cluster V2 ID %s: %s", id, obj.Status.Conditions[i].Message)
				}
			}
		}
		select {
		case <-time.After(rancher2RetriesWait * time.Second):
		case <-ctx.Done():
			return nil, fmt.Errorf("Timeout waiting for cluster V2 ID %s", id)
		}
	}
}
```

This change allows me to create RKE2 clusters using a "Standard User" token:

```
Terraform will perform the following actions:

  # rancher2_cluster_v2.cluster will be created
  + resource "rancher2_cluster_v2" "cluster" {
      + annotations                = (known after apply)
      + cluster_registration_token = (sensitive value)
      + cluster_v1_id              = (known after apply)
      + enable_network_policy      = (known after apply)
      + fleet_namespace            = "fleet-default"
      + id                         = (known after apply)
      + kube_config                = (sensitive value)
      + kubernetes_version         = "v1.21.4-rke2r2"
      + labels                     = (known after apply)
      + name                       = "rke2-terraform-test"
      + resource_version           = (known after apply)

      + rke_config {
          + additional_manifest   = (known after apply)
          + chart_values          = (known after apply)
          + machine_global_config = (known after apply)

          + etcd {
              + disable_snapshots      = (known after apply)
              + snapshot_retention     = (known after apply)
              + snapshot_schedule_cron = (known after apply)

              + s3_config {
                  + bucket                = (known after apply)
                  + cloud_credential_name = (known after apply)
                  + endpoint              = (known after apply)
                  + endpoint_ca           = (known after apply)
                  + folder                = (known after apply)
                  + region                = (known after apply)
                  + skip_ssl_verify       = (known after apply)
                }
            }

          + local_auth_endpoint {
              + ca_certs = (known after apply)
              + enabled  = (known after apply)
              + fqdn     = (known after apply)
            }

          + machine_pools {
              + annotations                  = (known after apply)
              + cloud_credential_secret_name = (known after apply)
              + control_plane_role           = (known after apply)
              + etcd_role                    = (known after apply)
              + labels                       = (known after apply)
              + name                         = (known after apply)
              + paused                       = (known after apply)
              + quantity                     = (known after apply)
              + worker_role                  = (known after apply)

              + machine_config {
                  + kind = (known after apply)
                  + name = (known after apply)
                }

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }

              + taints {
                  + effect = (known after apply)
                  + key    = (known after apply)
                  + value  = (known after apply)
                }
            }

          + machine_selector_config {
              + config = (known after apply)

              + machine_label_selector {
                  + match_labels = (known after apply)

                  + match_expressions {
                      + key      = (known after apply)
                      + operator = (known after apply)
                      + values   = (known after apply)
                    }
                }
            }

          + registries {
              + configs {
                  + auth_config_secret_name = (known after apply)
                  + ca_bundle               = (known after apply)
                  + hostname                = (known after apply)
                  + insecure                = (known after apply)
                  + tls_secret_name         = (known after apply)
                }

              + mirrors {
                  + endpoints = (known after apply)
                  + hostname  = (known after apply)
                  + rewrites  = (known after apply)
                }
            }

          + upgrade_strategy {
              + control_plane_concurrency = (known after apply)
              + worker_concurrency        = (known after apply)

              + control_plane_drain_options {
                  + delete_empty_dir_data                = (known after apply)
                  + disable_eviction                     = (known after apply)
                  + enabled                              = (known after apply)
                  + force                                = (known after apply)
                  + grace_period                         = (known after apply)
                  + ignore_daemon_sets                   = (known after apply)
                  + ignore_errors                        = (known after apply)
                  + skip_wait_for_delete_timeout_seconds = (known after apply)
                  + timeout                              = (known after apply)
                }

              + worker_drain_options {
                  + delete_empty_dir_data                = (known after apply)
                  + disable_eviction                     = (known after apply)
                  + enabled                              = (known after apply)
                  + force                                = (known after apply)
                  + grace_period                         = (known after apply)
                  + ignore_daemon_sets                   = (known after apply)
                  + ignore_errors                        = (known after apply)
                  + skip_wait_for_delete_timeout_seconds = (known after apply)
                  + timeout                              = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2021-10-06T16:11:27.298+0200 [INFO]  provider: configuring client automatic mTLS
2021-10-06T16:11:27.328+0200 [DEBUG] provider: starting plugin: path=/home/simon/work/k8s/terraform-provider-rancher2/bin/terraform-provider-rancher2 args=[/home/simon/work/k8s/terraform-provider-rancher2/bin/terraform-provider-rancher2]
2021-10-06T16:11:27.328+0200 [DEBUG] provider: plugin started: path=/home/simon/work/k8s/terraform-provider-rancher2/bin/terraform-provider-rancher2 pid=354671
2021-10-06T16:11:27.328+0200 [DEBUG] provider: waiting for RPC address: path=/home/simon/work/k8s/terraform-provider-rancher2/bin/terraform-provider-rancher2
2021-10-06T16:11:27.352+0200 [INFO]  provider.terraform-provider-rancher2: configuring server automatic mTLS: timestamp=2021-10-06T16:11:27.352+0200
2021-10-06T16:11:27.381+0200 [DEBUG] provider.terraform-provider-rancher2: plugin address: address=/tmp/plugin131889839 network=unix timestamp=2021-10-06T16:11:27.381+0200
2021-10-06T16:11:27.381+0200 [DEBUG] provider: using plugin: version=5
rancher2_cluster_v2.cluster: Creating...
2021-10-06T16:11:27.463+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:27 [DEBUG] setting computed for "rke_config" from ComputedKeys
2021-10-06T16:11:27.463+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:27 [DEBUG] setting computed for "cluster_registration_token" from ComputedKeys
2021-10-06T16:11:27.463+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:27 [DEBUG] setting computed for "labels" from ComputedKeys
2021-10-06T16:11:27.463+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:27 [DEBUG] setting computed for "annotations" from ComputedKeys
2021-10-06T16:11:27.463+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:27 [INFO] Creating Cluster V2 rke2-terraform-test
2021-10-06T16:11:27.463+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:27 Getting from  https://test.rancher.<redacted>/ping
2021-10-06T16:11:27.488+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:27 Time to get req:  25  ms
2021-10-06T16:11:29.131+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:29 [INFO] Cluster ID fleet-default/rke2-terraform-test forbidden.
2021-10-06T16:11:34.733+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:34 [INFO] Refreshing Cluster V2 fleet-default/rke2-terraform-test
2021-10-06T16:11:35.245+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:35 Getting from  https://test.rancher.<redacted>/ping
2021-10-06T16:11:35.266+0200 [DEBUG] provider.terraform-provider-rancher2: 2021/10/06 16:11:35 Time to get req:  20  ms
rancher2_cluster_v2.cluster: Creation complete after 9s [id=fleet-default/rke2-terraform-test]
2021-10-06T16:11:36.384+0200 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-10-06T16:11:36.386+0200 [DEBUG] provider: plugin process exited: path=/home/simon/work/k8s/terraform-provider-rancher2/bin/terraform-provider-rancher2 pid=354671
2021-10-06T16:11:36.386+0200 [DEBUG] provider: plugin exited

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```